---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightGroupManager.Dispose
source: html/07383909-c881-94b0-ada2-a4037caa1888.htm
---
# Autodesk.Revit.DB.Lighting.LightGroupManager.Dispose Method

Releases all resources used by the LightGroupManager

## Syntax (C#)
```csharp
public void Dispose()
```